app/Controllers/Admin.php

	public function index()
	{
		$user = session()->get('user');

		if (!$user) {
			return redirect()->to('/login');
		}

		if ($user['role'] !== 'admin') {
			return redirect()->to('/dashboard');
		}

		$data = [
			'title' => 'Dashboard',
			'active' => 'Dashboard',
			'user' => $user,
			'pegawai' => new \App\Models\PegawaiModel()->findAll(),
		];
---
SELECT *
FROM `pegawai`