app/Controllers/Auth.php

    public function login()
    {
        try {
            $session = session();
            $model = new PegawaiModel();
            $idPegawai = $this->request->getPost('id_pegawai');
            $password = $this->request->getPost('password');

            $pegawai = $model->where('id_pegawai', $idPegawai)->first();
---
SELECT *
FROM `pegawai`
WHERE `id_pegawai` = '2303040072'
 LIMIT 1