app/Controllers/Dashboard.php

	public function admin()
	{
		$this->data['pegawai'] = new PegawaiModel()->findAll();
---
SELECT *
FROM `pegawai`