app/Controllers/Jabatan.php

    public function index()
    {
        $this->data['jabatans'] = (new JabatanModel())->findAll();
---
SELECT *
FROM `jabatan`

    public function show($id)
    {
        $jabatanModel = new JabatanModel();
        $pegawaiModel = new \App\Models\PegawaiModel();

        $jabatan = $jabatanModel->find($id);

        if (!$jabatan) {
            return redirect()->back()->with('error', 'Jabatan tidak ditemukan');
        }

        // Get count of employees with this position
        $jumlah_pegawai = $pegawaiModel->where('id_jabatan', $id)->countAllResults();

        // Get list of employees with this position
        $pegawai_list = $pegawaiModel->where('id_jabatan', $id)->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `pegawai`
WHERE `id_jabatan` = '6'
SELECT *
FROM `jabatan`
WHERE `jabatan`.`id_jabatan` = '6'
SELECT *
FROM `pegawai`
WHERE `id_jabatan` = '6'

    public function delete($id)
    {
        $jabatanModel = new JabatanModel();
        $pegawaiModel = new \App\Models\PegawaiModel();
        $jabatan = $jabatanModel->find($id);

        if (!$jabatan) {
            return redirect()->back()->with('error', 'Jabatan tidak ditemukan');
        }

        // Check if there are any employees referencing this jabatan
        $existingPegawai = $pegawaiModel->where('id_jabatan', $id)->first();
---
SELECT *
FROM `pegawai`
WHERE `id_jabatan` = '6'
 LIMIT 1
SELECT *
FROM `jabatan`
WHERE `jabatan`.`id_jabatan` = '6'

    public function store()
    {
        $jabatanModel = new JabatanModel();

        $data = [
            'nama_jabatan' => $this->request->getPost('nama_jabatan'),
        ];

        if ($jabatanModel->insert($data)) {
---
INSERT INTO `jabatan` (`nama_jabatan`) VALUES ('adsa')