app/Controllers/Pegawai.php

    public function __construct()
    {
        $this->user = session()->get('user');

        $this->data = [
            // 'sidebarMenu' => $this->adminSidebarMenu,
            'title' => 'Pegawai',
            'active' => 'Pegawai',
            'user' => $this->user,
            'pegawai' => (new PegawaiModel())->findAll(),
        ];
---
SELECT *
FROM `pegawai`