app/Models/CutiModel.php

SELECT `cuti`.*, `pegawai`.`nama_lengkap`
FROM `cuti`
LEFT JOIN `pegawai` ON `pegawai`.`id_pegawai` = `cuti`.`id_pegawai`
---
    public function getCuti($id = false)
    {
        $builder = $this->db->table($this->table);
        $builder->select('cuti.*, pegawai.nama_lengkap as nama_pegawai, DATEDIFF(cuti.tanggal_selesai, cuti.tanggal_mulai) + 1 as jumlah_hari');
        $builder->join('pegawai', 'pegawai.id_pegawai = cuti.id_pegawai', 'left');

        if ($id !== false) {
            $builder->where('cuti.id_cuti', $id); // id_cuti
        }

        return $builder->get()->getRowArray();

SELECT `cuti`.*, `pegawai`.`nama_lengkap` as `nama_pegawai`, DATEDIFF(cuti.tanggal_selesai, cuti.tanggal_mulai) + 1 as jumlah_hari
FROM `cuti`
LEFT JOIN `pegawai` ON `pegawai`.`id_pegawai` = `cuti`.`id_pegawai`
WHERE `cuti`.`id_pegawai` = '2303040072'
---
    public function getCutiByPegawai($id_pegawai = false)
    {
        $builder = $this->db->table($this->table);
        $builder->select('cuti.*, pegawai.nama_lengkap as nama_pegawai, DATEDIFF(cuti.tanggal_selesai, cuti.tanggal_mulai) + 1 as jumlah_hari');
        $builder->join('pegawai', 'pegawai.id_pegawai = cuti.id_pegawai', 'left');

        if ($id_pegawai !== false) {
            $builder->where('cuti.id_pegawai', $id_pegawai); // bukan id_cuti
        }

        return $builder->get()->getResultArray(); // ← array of arrays

SELECT `cuti`.`jenis`, COUNT(*) as total
FROM `cuti`
GROUP BY `jenis`
---
    public function getCutiStatsByJenis($jenis = false)
    {
        $builder = $this->db->table($this->table);
        $builder->select('cuti.jenis, COUNT(*) as total');
        $builder->groupBy('jenis');

        if ($jenis === false) {
            return $builder->get()->getResultArray();

UPDATE `cuti` SET `status` = 'ditolak'
WHERE `cuti`.`id_cuti` IN ('1')
---
    public function approveCuti($id)
    {
        $data = [
            'status' => 'disetujui',
        ];
        return $this->update($id, $data);

SELECT `cuti`.`jenis`, COUNT(*) as total
FROM `cuti`
WHERE `cuti`.`status` = 'disetujui'
GROUP BY `cuti`.`jenis`
---
    public function getApprovedCutiStatsByJenis($jenis = false)
    {
        $builder = $this->db->table($this->table);
        $builder->select('cuti.jenis, COUNT(*) as total');
        // Only include approved leaves
        $builder->where('cuti.status', 'disetujui');
        $builder->groupBy('cuti.jenis');

        if ($jenis === false) {
            return $builder->get()->getResultArray();