app/Models/JabatanModel.php

SELECT *
FROM `jabatan`
SELECT *
FROM `jabatan`
WHERE `id_jabatan` = '3'
 LIMIT 1
---
    public function getJabatan($id = false)
    {
        if ($id === false) {
            return $this->findAll();
        }

        return $this->where(['id_jabatan' => $id])->first();